# encoding: UTF-8
"""
展示如何执行策略回测。
主要还是理解回测的主要逻辑
"""
from vnpy.trader.app.ctaStrategy.ctaBacktesting import BacktestingEngine
import json


Dbname = 'VnTrader_1Min_Db'


if __name__ == '__main__':
    from StrategyBollBand import BollBandsStrategy

    # 创建回测引擎
    engine = BacktestingEngine()

    # 设置引擎的回测模式为K线
    engine.setBacktestingMode(engine.BAR_MODE)

    # 设置使用的历史数据库
    engine.setDB_URI("mongodb://localhost:32768")
    engine.setDatabase('VnTrader_1Min_Db')

    # 设置回测用的数据起始日期，initHours 默认值为 0
    engine.setStartDate('20181214 23:00:00', initHours=120)
    engine.setEndDate('20190314 23:00:00')

    # 设置产品相关参数
    engine.setCapital(1000000)      # 设置起始资金，默认值是1,000,000
    # 设置交易合约对的回测的参数值
    contracts = [
        {"symbol":"ETHUSD:BITFINEX",
        "size" : 10,
        "priceTick" : 0.001,
        "rate" : 5/10000,
        "slippage" : 0.005
        }]
    engine.setContracts(contracts)         # 设置回测合约相关数据

    # =============配置策略报告的输出的路径，这里是macos 的路径的输出
    # 策略报告默认为False不输出，True为输出，且默认输出目录路径于当前文件夹下
    engine.setLog(True, path = "vnpy_data")

    # 设置本地数据缓存的路径，默认数据缓存存放目录: ~/vnpy_data
    engine.setCachePath("vnpy_data")


    # =============配置策略报告的输出的路径，这里是window 的路径的输出
    # 策略报告默认为False不输出，True为输出，且默认输出目录路径于当前文件夹下
    # engine.setLog(True, path = "D:\\vnpy_data\\")

    # 设置本地数据缓存的路径，默认数据缓存存放目录: ~/vnpy_data
    # engine.setCachePath("D:\\vnpy_data\\")


    # 在引擎中创建策略对象
    with open("CTA_setting.json") as parameterDict:
        setting = json.load(parameterDict)[1]
        print("setting",setting)

    #初始化回测先关值
    engine.initStrategy(BollBandsStrategy, setting)

    # 开始跑回测
    engine.runBacktesting()

    # 显示回测结果
    engine.showBacktestingResult()
    engine.showDailyResult()









"""
2019-09-21 13:31:47.757678	------------------------------
2019-09-21 13:31:47.757720	第一笔交易：	2018-12-21 09:07:00
2019-09-21 13:31:47.757745	最后一笔交易：	2019-03-05 07:41:00
2019-09-21 13:31:47.757780	总交易次数：	6
2019-09-21 13:31:47.757816	总盈亏：	-104.23
2019-09-21 13:31:47.757842	最大回撤: 	-133.67
2019-09-21 13:31:47.757865	平均每笔盈利：	-17.37
2019-09-21 13:31:47.757886	平均每笔滑点：	0.1
2019-09-21 13:31:47.757907	平均每笔佣金：	1.24
2019-09-21 13:31:47.757929	胜率		16.67%
2019-09-21 13:31:47.757948	盈利交易平均值	33.41
2019-09-21 13:31:47.757967	亏损交易平均值	-27.53
2019-09-21 13:31:47.757986	盈亏比：	1.21
2019-09-21 13:31:48.473499	策略回测统计图已保存
2019-09-21 13:31:48.708386	计算按日统计结果
2019-09-21 13:31:48.823604	------------------------------
2019-09-21 13:31:48.823643	首个交易日：	2018-12-14
2019-09-21 13:31:48.823664	最后交易日：	2019-03-14
2019-09-21 13:31:48.823680	总交易日：	91
2019-09-21 13:31:48.823696	盈利交易日	1
2019-09-21 13:31:48.823711	亏损交易日：	5
2019-09-21 13:31:48.823727	起始资金：	1000000
2019-09-21 13:31:48.823760	结束资金：	999,895.77
2019-09-21 13:31:48.823785	总收益率：	-0.01%
2019-09-21 13:31:48.823808	年化收益：	-0.03%
2019-09-21 13:31:48.823831	总盈亏：	-104.23
2019-09-21 13:31:48.823854	最大回撤: 	-133.67
2019-09-21 13:31:48.823876	百分比最大回撤: -0.01%
2019-09-21 13:31:48.823898	卡玛比率：	-2.06
2019-09-21 13:31:48.823920	总手续费：	7.46
2019-09-21 13:31:48.823941	总滑点：	0.6
2019-09-21 13:31:48.823964	总成交金额：	14,919.9
2019-09-21 13:31:48.823985	总成交笔数：	12
2019-09-21 13:31:48.824006	日均盈亏：	-1.15
2019-09-21 13:31:48.824027	日均手续费：	0.08
2019-09-21 13:31:48.824048	日均滑点：	0.01
2019-09-21 13:31:48.824073	日均成交金额：	163.95
2019-09-21 13:31:48.824095	日均成交笔数：	0.13
2019-09-21 13:31:48.824117	日均收益率：	-0.0%
2019-09-21 13:31:48.824138	收益标准差：	0.0%
2019-09-21 13:31:48.824159	Sharpe Ratio：	-2.11
2019-09-21 13:31:48.824181	日均收益率(0交易成本)：	-0.0%
2019-09-21 13:31:48.824203	收益标准差(0交易成本)：	0.0%
2019-09-21 13:31:48.824226	Sharpe Ratio(0交易成本)：	-1.99
2019-09-21 13:31:48.824248	理论可实现Sharpe Ratio(0交易成本)：	0.65
2019-09-21 13:31:50.886877	策略回测绩效图已保存
2019-09-21 13:31:50.887579	BacktestingResult saved
2019-09-21 13:31:50.891919	每日净值已保存
"""